#include "WinMain.h"
#include "SE.h"

//---------------------------------------------------------------------------
//  SE用の配列変数の獲得用関数
//---------------------------------------------------------------------------
SE::~SE()
{
	SE_Delete();
}

//---------------------------------------------------------------------------
//  SE用の配列変数の獲得用関数
//---------------------------------------------------------------------------
void SE::SE_ContainerNew(int size)
{
	// SE分の配列の確保
	se_container = new int[size];
}

//---------------------------------------------------------------------------
//  SEの読み込み用関数
//---------------------------------------------------------------------------
void SE::Load_SE(const char name[256], int No)
{
	// SEデータの読み込み
	se_container[No] = LoadSoundMem(name);
}

//---------------------------------------------------------------------------
//  SEの再生用関数
//---------------------------------------------------------------------------
void SE::Play_SE(int No, int type, bool loop)
{
	// SEの再生
	PlaySoundMem(se_container[No], type, loop);
}

//---------------------------------------------------------------------------
//  SEの再生中かを返す用関数
//---------------------------------------------------------------------------
bool SE::Playing_SE(int No)
{
	int playing; // 再生中かの番号を入れる用の変数
	// 再生中か調べる
	// 再生中          ：  １
	// 再生されていない：  ０
	// エラー          ：－１
	playing = CheckSoundMem(se_container[No]);
	if (playing == 1) {
		return true;
	}
	if (playing == 0) {
		return false;
	}
}


//---------------------------------------------------------------------------
// SEのデリート（配列の解放）
//---------------------------------------------------------------------------
void SE::SE_Delete()
{
	InitSoundMem();        // 読み込んだSEの削除
	delete[] se_container; // 
	
}


